// 中文版本更新日志
(function (namespace, className) {
    /**
     * 版本更新日志
     */
    var module = {
        "Currentver": "H1027.0.0",
        "data": [
            {
                "ver": "H1027.0.0",
                "updateLoglist": [
                    {
                        "update_time": "2019.10.30",
                        "detail": "1.优化图片控件，支持图片圆角设置以及更多工具功能。<br>2.优化文字控件，支持修改字体、修改项目符号、对齐方式选择，字符空格回车换行功能以及更多工具功能。<br>3.支持帧动画控件，允许用户编辑帧动画。<br>4.新增游戏分享控件，支持用户自定义作品分享渠道。<br>5.新增加载页面控件，支持用户编辑作品加载页面。<br>6.更新创作图书馆UI效果。<br>7.优化分享链接，缩短分享链接长度，减少二维码复杂度。<br>8.优化可视化编辑页面，统一使用底部通用编辑控件。<br>"
                    }
                ]
            },
            {
                "ver": "H1026.3.0",
                "updateLoglist": [
                    {
                        "update_time": "2019.10.22",
                        "detail": "1.修复部分提示语英文环境下未翻译问题。<br>"
                    }
                ]
            },
            {
                "ver": "H1026.2.0",
                "updateLoglist": [
                    {
                        "update_time": "2019.10.16",
                        "detail": "1.修复编辑页面内存泄漏问题。<br>2.修复游戏作品无法分享问题。<br>3.修复多语言环境下表格控件二次编辑数据异常问题。<br>"
                    }
                ]
            },
            {
                "ver": "H1026.1.0",
                "updateLoglist": [
                    {
                        "update_time": "2019.10.09",
                        "detail": "1.修复音频控件使用音频小于1s情况下造成偶发崩溃的问题。<br>"
                    }
                ]
            },
            {
                "ver": "H1026.0.0",
                "updateLoglist": [
                    {
                        "update_time": "2019.09.25",
                        "detail": "1.H5端新增分享游戏、发布游戏、试玩游戏、编辑游戏、导出功能等埋点，支持记录用户操作数据。<br>2.新增新手引导功能。<br>3.音频控件新增音频编辑功能。<br>4.图片控件新增图形裁剪、旋转、透明度、gif裁剪功能，文字转图片背景新增在线图片与本地图片上传，修改在线图片资源加载效果。<br>5.支持音频转码压缩功能，将上传音频格式统一转码为mp3格式。<br>6.新增分享功能，支持分享到QQ、微博。<br>7.新增大厅和模板中导出游戏和编辑器，支持记录用户保存模板历史记录。<br>8.优化编辑器框架，新增关卡编辑控件以及资源管理控件。<br>9.新增时间选择器通用编辑控件。<br>10.更新IM界面UI效果。<br>11.更新帮助中心UI效果。<br>12.统一界面loading规范。<br>13.优化注册页面交互功能。<br>14.搜索方法替换为ES搜索，优化搜索功能，提升搜索速度。<br>15.优化SDK，支持大厅和游戏单点登录功能。<br>16.优化 H5 SDK加载流程以及游戏大厅和编辑框架试玩功能。<br>17.支持H5页面自动刷新，解决页面数据缓存问题。<br>"
                    }
                ]
            },
            {
                "ver": "H1025.0.0",
                "updateLoglist": [
                    {
                        "update_time": "2019.09.06",
                        "detail": "1. 修复非可视化关卡二次编辑数据丢失的问题。<br>"
                    }
                ]
            },
            {
                "ver": "H1023.0.0",
                "updateLoglist": [
                    {
                        "update_time": "2019.08.30",
                        "detail": "1. 优化登录注册流程，修复edmodo第三方账号登录问题，更新登录界面Logo和登录方式。<br>2. 大厅设置界面新增版本更新日志功能。<br>3. 优化中转程序，修复部分电脑在unity编辑界面无法试玩的问题。<br>4. 修复H5大厅新框架BUG。<br>"
                    }
                ]
            },
            {
                "ver": "H1022.0.0",
                "updateLoglist": [
                    {
                        "update_time": "2019.08.06",
                        "detail": "1. H5端大厅上线。<br>"
                    }
                ]
            }
        ]
    };

    if (namespace && className && !namespace[className]) {
        namespace[className] = module;
    }
}(UtilBarn, "SimplifiedChinese"));